Infineon/cmsis_packs/TLE985x/Infineon.TLE985x_DFP.pdsc
          <device Dname="TLE9855QX">
            <processor Dclock="40000000"/>
            <compile header="Device/Include/tle985x.h" define="TLE9855QX"/>
            <debug      svd="SVD/TLE985x.svd"/>
            <memory     id="IROM1"                      start="0x11000000"  size="0x18000"    startup="1"   default="1"/>
            <memory     id="IROM2"                      start="0x10FFFFFC"  size="4"          startup="0"   default="1"/>
            <memory     id="IRAM1"                      start="0x18000000"  size="0x1000"     init   ="0"   default="1"/>
            <algorithm  name="Flash/TLE985x_OPT.FLM"    start="0x10FFFFFC"  size="0x4"                      default="1"/>
            <algorithm  name="Flash/TLE9855.FLM"        start="0x11000000"  size="0x17000"                  default="1"/>
            <algorithm  name="Flash/TLE9855_EEP.FLM"    start="0x11017000"  size="0x1000"                   default="1"/>
            <book    name="Documents/TLE985xQX-Users-Manual-10-Infineon.pdf"        title="TLE985x Series Reference Manual"/>
            <book    name="Documents/TLE985xQX-BootROM-User-Manual-10-Infineon.pdf" title="TLE985x Series BootROM Manual"/>
            <book    name="Documents/TLE9855QX-Data-Sheet-10-Infineon.pdf"          title="TLE9855QX Data Sheet"/>
            <book    name="Documents/html/index.html" title="SDK Help"/>
            <feature type="ADC"           n="1"       m="10"/>
            <feature type="ADC"           n="1"       m="8"/>
            <feature type="IOs"           n="11"/>
          </device>
    </subFamily>
   </family>
  </devices>

  <conditions>
  <!-- conditions are dependency rules that can apply to a component or an individual file -->
    <condition id="TLE985x CMSIS Device">
      <description>Infineon TLE95x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Cclass="Device" Cgroup="SDK" Csub="SCU"/>
      <require Cclass="Device" Cgroup="SDK" Csub="BOOTROM"/>
      <require Cclass="Device" Cgroup="SDK" Csub="WDT1"/>
      <require Cclass="Device" Cgroup="SDK" Csub="ISR"/>
      <require Cclass="Device" Cgroup="SDK" Csub="INT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="LIN"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PORT"/>
      <require Cclass="Device" Cgroup="SDK" Csub="PMU"/>
      <require Dvendor="Infineon:7" Dname="TLE985*QX*"/>
    </condition>

    <condition id="TLE985x">
      <description>Infineon TLE985x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE985*QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <!--condition id="TLE9851QXW">
      <description>Infineon TLE9851QXW device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9851QXW"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9853QX">
      <description>Infineon TLE9853QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9853QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9854QX">
      <description>Infineon TLE9854QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9854QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9855QX">
      <description>Infineon TLE9855QX device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9855QX"/>
      <require Tcompiler="ARMCC"/>
    </condition-->

    <!--condition id="TLE985x ARM">
      <description>Infineon TLE985x device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE985*QX*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9851 ARM">
      <description>Infineon TLE9851 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9851QXW"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9853 ARM">
      <description>Infineon TLE9853 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9853QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9854 ARM">
      <description>Infineon TLE9854 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9854QX"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="TLE9855 ARM">
      <description>Infineon TLE9855 device series</description>
      <require Cclass ="CMSIS" Cgroup="CORE" Csub=""/>
      <require Dvendor="Infineon:7" Dname="TLE9855QX"/>
      <require Tcompiler="ARMCC"/>
    </condition-->
  </conditions>

   <boards>
    <board vendor="Infineon" name="TLE9855QX Eval.Kit V1.1" revision="V1.1" salesContact="sales@infineon.com" orderForm="http://www.infineon.com/embeddedpower">
      <description>Infineon TLE985x Evaluation Board Support and Examples</description>
      <image small="Images/TLE985x_EvalBoard_v1_0_top_small.jpg" large="Images/TLE985x_EvalBoard_v1_0_top_large.jpg"/>
      <!--book category="overview"  name="http://www.infineon.com/cms/en/product/evaluation-boards/TLE9879+EVALKIT/evaluation-boards/TLE9879+EVALKIT/productType.html?productType=5546d4624e765da5014eb4e2cc3f2fc5" title="TLE9879 EvalKit Web Page"/-->
      <!--book category="setup"     name="Documents/TLE9879-EvalKit-UM-110-Infineon.pdf" title="Getting Started"/-->
      <book category="schematic" name="Documents/TLE9855_EvalKit_V1.1.zip" title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="TLE9855QX"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="TLE985x Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-Linke Lite Debugger"/>
        <feature type="PWR"       n="12" m="28"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="48"             name="Pins at pin headers"/>
        <feature type="AIO"       n="12"             name="Analog inputs at AD"/>
        <feature type="LED"       n="9"              name="User LEDs"/>
        <feature type="Button"    n="5"              name="Push-buttons: Reset, MON1-MON4"/>
        <feature type="Poti"      n="1"/>
      <debugInterface adapter="J-Link Lite" connector="Mini-USB"/>
    </board>
  </boards>

