Infineon/cmsis_packs/TLE985x/Infineon.TLE985x_DFP.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="0.0.1" condition="TLE985x CMSIS Device">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon TLE985x device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/Include/"/>
        
        <!-- startup files -->
        <file category="source"  name="Device/Source/ARM/startup_tle985x.S" attr="config" condition="TLE985x" version="0.1.0"/>

        <!-- system file -->
        <file category="source"  name="Device/Source/system_tle985x.c"      attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/system_tle985x.h"     attr="config" condition="TLE985x" version="0.1.1"/>

        <file category="source"  name="Device/Source/tle_device.c"          attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/tle_device.h"         attr="config" condition="TLE985x" version="0.1.1"/>
        <file category="header"  name="Device/Include/tle_variants.h"       attr="config" condition="TLE985x" version="0.1.0"/>

        <file category="header"  name="Device/Include/types.h"              attr="config" condition="TLE985x" version="0.3.2"/>
        <file category="source"  name="Device/Include/sfr_access.h"         attr="config" condition="TLE985x" version="0.1.0"/>
        <file category="header"  name="Device/Include/cmsis_misra.h"        attr="config" condition="TLE985x" version="0.1.0"/>

        <file category="header"  name="Device/Include/tle985x.h"            attr="config" condition="TLE985x" version="1.0.0"/>
        <file category="sourceC" name="Device/SDK/app/main.c"               attr="template" select="Simple Main" condition="TLE985x" version="1.0.0"/>         
     </files>
    </component>

    <component Cclass="Device" Cgroup="ConfigWizard_v2" Cversion="2.1.12" condition="TLE985x">
     <description>Infineon Config Wizard v2 support</description>
     <files>
        <file category="doc" name="Device/SDK/cfgwiz/config.icwp"            attr="config" condition="TLE985x" version="0.0.0"/>
        <file category="doc" name="Device/SDK/cfgwiz/script/ICW_TLE985x.xml" attr="config" condition="TLE985x" version="1.0.0"/>
        <file category="doc" name="Device/SDK/cfgwiz/script/TLE985x.mig"     attr="config" condition="TLE985x" version="0.1.0"/>
        <file category="doc" name="SVD/TLE985x.svd"                          attr="config" condition="TLE985x" version="1.0.0"/>

        <file category="header" name="Device/SDK/cfgwiz/bsl_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/scu_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/int_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/isr_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/lin_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/port_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/pmu_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/adc1_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/adc2_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/bdrv_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/ccu6_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/csa_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/gpt12e_defines.h"  attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/mon_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/ssc_defines.h"     attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/timer2x_defines.h" attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/uart_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/math_defines.h"    attr="config" version="0.0.0"/>      
        <file category="header" name="Device/SDK/cfgwiz/hs_defines.h"      attr="config" version="0.0.0"/>      
     </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="SCU" Cversion="0.2.3" condition="TLE985x CMSIS Device">
      <description>System Control Unit (SCU) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_SCU
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/scu.h" version="0.2.3"/>
        <file category="source" attr="config" name="Device/SDK/src/scu.c" version="0.2.3"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="BOOTROM" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>BootROM driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_BROM
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/bootrom.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/bootrom.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="WDT1" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>Watchdog 1 (WDT1) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_WDT1
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/wdt1.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/wdt1.c" version="0.2.1"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SDK" Csub="INT" Cversion="0.2.1" condition="TLE985x CMSIS Device">
      <description>Interrupt (INT) driver for TLE985x</description>
      <RTE_Components_h>
        #define RTE_DEVICE_SDK_INT
      </RTE_Components_h>  
      <files>
        <file category="header" attr="config" name="Device/SDK/inc/int.h" version="0.2.1"/>
        <file category="source" attr="config" name="Device/SDK/src/int.c" version="0.2.1"/>
      </files>
    </component>

